In [176]:
!pip install sqlalchemy
!pip install psycopg2-binary

Requirement already satisfied: sqlalchemy in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (2.0.29)
Requirement already satisfied: typing-extensions>=4.6.0 in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (from sqlalchemy) (4.9.0)
Requirement already satisfied: psycopg2-binary in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (2.9.9)

In [177]:
import sqlalchemy
import psycopg2
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy.sql import text

In [179]:
conn_url = "postgresql+psycopg2://postgres:123@localhost:5432/group2_finalschema"
engine = create_engine(conn_url)

In [181]:
home_listings_data = pd.read_csv('/Users/jy/Desktop/home_listings_cleaned.csv')
home_listings = home_listings_data
home_listings.columns
home_listings_data.columns

Index(['Listing ID', 'Title', 'Description', 'Home Type', 'Bedrooms',
       'Bathrooms', 'Year Built', 'Square Footage', 'Listed Price',
       'Listing Type', 'Amenities', 'Street', 'City', 'State', 'Zip Code',
       'Commute Options', 'Listing Date', 'Nearby Schools', 'Utilities',
       'Owner/Seller Name'],
      dtype='object')

In [182]:
employees_data = pd.read_csv('/Users/jy/Desktop/employees.csv')
employees = employees_data
employees.columns

Index(['Full Name', 'Email', 'Date of Hire', 'Base Salary', 'Office Name',
       'Manager Name'],
      dtype='object')

In [183]:
clients_data = pd.read_csv('/Users/jy/Desktop/clients 1.csv')
clients = clients_data
clients.columns

Index(['Name', 'Email', 'Phone Number', 'Street', 'State', 'Zip Code',
       'Client Type', 'Preferred Home Type', 'Preferred Number of Bedrooms',
       'Preferred Number of Bathrooms', 'Preferred Square Footage',
       'Preferred School Rating', 'Assigned Employee'],
      dtype='object')

In [184]:
office_expenses_data = pd.read_csv('/Users/jy/Desktop/office_expenses.csv')
office_expenses = office_expenses_data
office_expenses.columns

Index(['Office Name', 'Address', 'State', 'City', 'Date', 'Expense Type',
       'Amount'],
      dtype='object')

In [185]:
transaction_data = pd.read_csv('/Users/jy/Desktop/transaction.csv')
transaction = transaction_data
transaction.columns

Index(['listing_id', 'Employee Name', 'Client Name', 'time', 'price',
       'revenues'],
      dtype='object')

In [186]:
client_feedback_data = pd.read_csv('/Users/jy/Desktop/client_feedback.csv')
client_feedback = client_feedback_data
client_feedback.columns

Index(['Employee Name', 'Client Name', 'time', 'rating', 'comment'], dtype='object')

In [187]:
school_data = pd.read_csv('/Users/jy/Desktop/school 2.csv')
school = school_data
school.columns

Index(['school_ID', 'school_name', 'school_rating', 'school_type',
       'school_level', 'state', 'city', 'street', 'zip_code'],
      dtype='object')

In [188]:
neighborhood_data = pd.read_csv('/Users/jy/Desktop/neighborhood.csv')
neighborhood = neighborhood_data
neighborhood.columns

Index(['Street', 'City', 'State', 'neighborhood_name', 'crime_rate'], dtype='object')

In [189]:
appointments_data = pd.read_csv('/Users/jy/Desktop/appointments.csv')
appointments = appointments_data
appointments.columns

Index(['Employee Name', 'Client Name', 'time', 'listing_id'], dtype='object')

In [190]:
# Generating unique neighborhood_id based on neighborhood_name
neighborhood['neighborhood_id'], _ = pd.factorize(neighborhood['neighborhood_name'], sort=True)

# Incrementing IDs by 1 to start from 1 instead of 0
neighborhood['neighborhood_id'] += 1

# Select only necessary columns
neighborhood_table = neighborhood[['neighborhood_id', 'neighborhood_name', 'crime_rate']]

In [191]:
neighborhood_table = neighborhood_table.drop_duplicates()

In [192]:
neighborhood_table

     neighborhood_id    neighborhood_name  crime_rate
0                  3   Downtown Manhattan         1.7
1                 17          South Bronx         3.6
2                 13         Midtown West         6.1
3                 20        South Trenton         1.0
4                  8        East Hartford         2.7
5                 16      Northern Queens         9.3
6                  5    Downtown Stamford         9.4
7                 14      North New Haven         7.1
8                  4  Downtown New London         3.2
9                 19  South Staten Island         6.3
12                 1    Downtown Brooklyn         4.8
13                18        South Norwalk         7.0
15                 7       East Elizabeth         4.5
16                 9      Lower East Side         6.8
21                11    Mid New Brunswick         7.6
27                12         Midtown East         2.1
28                 2      Downtown Camden         1.3
48                15  North Staten Island         2.0
49                22      Upper West Side         7.7
50                23           West Bronx         1.7
67                 6           East Bronx         5.7
69                21      Upper East Side         8.0
131               10      Lower West Side         1.5

In [193]:
# Assuming 'clients', 'school', and 'office' DataFrames are already loaded
clients_address = clients[['State', 'Street', 'Zip Code']]
school_address = school[['state', 'city', 'street', 'zip_code']]
office_address = office_expenses[['State', 'City', 'Address']]
home_listings_address = home_listings[['Street', 'State', 'City','Zip Code']]


# Rename columns to match the 'address' table schema
clients_address.columns = ['state', 'street', 'zip_code']
office_address.columns = ['state', 'city', 'street']
home_listings_address.columns = ['street', 'state', 'city','zip_code']

# Combine all addresses into one DataFrame
all_addresses = pd.concat([clients_address, school_address, office_address,home_listings_address], ignore_index=True)

In [194]:
all_addresses['zip_code'] = all_addresses['zip_code'].fillna(0)  #  fill NaN with 0
all_addresses['zip_code'] = all_addresses['zip_code'].astype(int)

In [195]:
addresses_unique = all_addresses.drop_duplicates().reset_index(drop=True)

# Assign a unique address_id
addresses_unique['address_id'] = range(1, len(addresses_unique) + 1)

In [196]:
addresses_unique['street'] = addresses_unique['street'].str.strip().str.lower()
neighborhood['street'] = neighborhood['Street'].str.strip().str.lower()

In [197]:
address_final = addresses_unique.merge(neighborhood[['neighborhood_id', 'street']], on='street', how='left')

In [198]:
address_final

,state,street,zip_code,city,address_id,neighborhood_id
0,NY,549 nguyen underpass suite 698,13309,NaN,1,NaN
1,CT,44362 dennis hill,6205,NaN,2,NaN
2,NY,9515 joseph manor apt. 900,10370,NaN,3,NaN
3,NJ,273 bernard ports apt. 062,8790,NaN,4,NaN
4,NY,45976 stone squares apt. 678,14496,NaN,5,NaN
...,...,...,...,...,...,...
4027,NY,28291 brandon stravenue,13271,Syracuse,4028,6.0
4028,NY,13328 waters ford suite 061,12965,New York,4029,16.0
4029,NY,033 wilson isle suite 690,11266,Buffalo,4030,16.0
4030,CT,7457 paula pines,6077,New Haven,4031,14.0
4031,CT,92007 michael corner apt. 146,6056,New Haven,4032,8.0

In [199]:
office_expenses.rename(columns={'Address': 'street', 'Office Name': 'office_name'}, inplace=True)

# Generating unique IDs for each office name
office_expenses['office_id'], _ = pd.factorize(office_expenses['office_name'], sort=True)
office_expenses['office_id'] += 1  # Adjust to start IDs from 1 instead of 0

# Standardize the street names for accurate matching
office_expenses['street'] = office_expenses['street'].str.strip().str.lower()
address_final['street'] = address_final['street'].str.strip().str.lower()

# Select only necessary columns
office_table = office_expenses[['office_id', 'office_name', 'street']]

In [200]:
# Assuming address DataFrame is available and contains 'address_id'
# Make sure to merge to fetch corresponding address_id
office = office_table.merge(addresses_unique[['address_id', 'street']], on='street', how='left')

In [201]:
# Assuming 'office_id' should be unique and each office has a unique address
office = office.drop_duplicates(subset='office_id')

In [202]:
office

,office_id,office_name,street,address_id
0,2,Dream Homes Bridgeport,09080 stone hill,3001
56,1,Dream Homes Albany,93021 charles rapid,3002
320,5,Dream Homes Jersey City,1783 laura lakes,3006
436,12,Dream Homes Syracuse,207 morgan courts suite 131,3007
640,4,Dream Homes Hartford,78301 daugherty brooks apt. 072,3009
844,9,Dream Homes Paterson,65434 christopher street,3011
1316,8,Dream Homes Newark,3824 burton meadow,3014
1384,10,Dream Homes Rochester,73776 wilson station apt. 201,3015
1644,11,Dream Homes Stamford,865 kim village,3018
1916,13,Dream Homes Trenton,5703 katherine crossing,3020
2156,14,Dream Homes Waterbury,9705 gary roads,3024
2264,7,Dream Homes New York,34968 miller neck apt. 364,3027
2336,6,Dream Homes New Haven,5709 nicholas drive,3028
2676,3,Dream Homes Buffalo,40298 perez drive suite 835,3032

In [203]:
# Assuming 'clients', 'school', and 'office' DataFrames are already loaded
clients_info = clients[['Name', 'Email', 'Phone Number']]
employees_info = employees[['Full Name', 'Email']]

# Rename columns to match the 'address' table schema
clients_info.columns = ['name', 'email', 'phone number']
employees_info.columns = ['name', 'email']

# Combine all addresses into one DataFrame
all_personal_info = pd.concat([clients_info, employees_info], ignore_index=True)

In [204]:
# Assign a unique address_id
all_personal_info['personal_info_id'] = range(1, len(all_personal_info) + 1)

In [205]:
all_personal_info.columns = ["name","email","phone_number","personal_info_id"]

In [206]:
all_personal_info

,name,email,phone_number,personal_info_id
0,"Melton, Ashley",ashley.melton@example.com,6076274707,1
1,"Cooley, Melissa",melissa.cooley@example.com,292-810-9738,2
2,"Gibbs, Angela",angela.gibbs@example.com,001-766-553-7400,3
3,"Gardner, Jasmine",jasmine.gardner@example.com,535.355.1974x252,4
4,"Castro, Charles",charles.castro@example.com,511.384.1001x42377,5
...,...,...,...,...
1115,"White, Gregory",gregory.white@dreamhomes.nyc,NaN,1116
1116,"Evans, Christina",christina.evans@dreamhomes.nyc,NaN,1117
1117,"Fry, Joseph",joseph.fry@dreamhomes.nyc,NaN,1118
1118,"Cruz, Pamela",pamela.cruz@dreamhomes.nyc,NaN,1119
1119,"Hopkins, Andrew",andrew.hopkins@dreamhomes.nyc,NaN,1120

In [207]:
# Select only necessary columns
employees = employees[[ 'Full Name', 'Office Name']]
employees.columns = ['employee_name', 'office_name',]

In [208]:
employees['employees_id'] = range(1, len(employees)+1)

/var/folders/5z/lj0frffj3bx0mq3z4v0_zkc00000gn/T/ipykernel_40342/4173120728.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  employees['employees_id'] = range(1, len(employees)+1)

In [209]:
employees.columns = ['name', 'office_name','employees_id']
employees = employees.merge(office[['office_id', 'office_name']], on='office_name', how='left')
employees = employees.merge(all_personal_info[['personal_info_id', 'name']], on='name', how='left')

In [210]:
employees.columns = ['employee_name', 'office_name','employees_id','office_id', 'personal_info_id']

In [211]:
employees

,employee_name,office_name,employees_id,office_id,personal_info_id
0,"Klein, Brian",Dream Homes Albany,1,1,1001
1,"Brown, Ryan",Dream Homes Hartford,2,4,1002
2,"Coffey, Patrick",Dream Homes Bridgeport,3,2,1003
3,"Watson, Samantha",Dream Homes Albany,4,1,1004
4,"Howard, Katherine",Dream Homes New York,5,7,1005
...,...,...,...,...,...
115,"White, Gregory",Dream Homes Stamford,116,11,1116
116,"Evans, Christina",Dream Homes Hartford,117,4,1117
117,"Fry, Joseph",Dream Homes Syracuse,118,12,1118
118,"Cruz, Pamela",Dream Homes Syracuse,119,12,1119
119,"Hopkins, Andrew",Dream Homes Syracuse,120,12,1120

In [212]:
# Select only necessary columns
clients = clients[[ 'Name', 'Preferred Home Type']]
clients.columns = ['name', 'preferred home type']

In [213]:
# Generating unique IDs 
clients['clients_id'] = range(1, len(clients)+1)

/var/folders/5z/lj0frffj3bx0mq3z4v0_zkc00000gn/T/ipykernel_40342/3477870990.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  clients['clients_id'] = range(1, len(clients)+1)

In [214]:
clients = clients.merge(all_personal_info[['personal_info_id', 'name']], on='name', how='left')

In [215]:
clients.columns = ['client_name', 'preferred_home_type', 'clients_id','personal_info_id']

In [216]:
clients

          client_name preferred_home_type  clients_id  personal_info_id
0      Melton, Ashley               condo           1                 1
1     Cooley, Melissa        single house           2                 2
2       Gibbs, Angela                 NaN           3                 3
3    Gardner, Jasmine               condo           4                 4
4     Castro, Charles                 NaN           5                 5
..                ...                 ...         ...               ...
995    Horton, Martin                 NaN         996               996
996       Rich, David           townhouse         997               997
997      Vega, Robert           apartment         998               998
998    Jimenez, Maria                 NaN         999               999
999   Miller, Brandon                 NaN        1000              1000

[1000 rows x 4 columns]

In [217]:
# Select only necessary columns
school = school[[ 'school_ID', 'school_name', 'school_rating','school_type', 'school_level', 'street']]
school.columns = ['school_id', 'school_name', 'school_rating','school_type', 'school_level', 'street']

In [218]:
school['street'] = school['street'].str.strip().str.lower()
school = school.merge(addresses_unique[['address_id', 'street']], on='street', how='left')

/var/folders/5z/lj0frffj3bx0mq3z4v0_zkc00000gn/T/ipykernel_40342/3031764568.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  school['street'] = school['street'].str.strip().str.lower()

In [219]:
school

,school_id,school_name,school_rating,school_type,school_level,street,address_id
0,1,"Jackson, Smith and Williams",5,Public,Middle,631 pine drive,1001
1,2,Wilson Inc,8,Private,High,380 chad valley,1002
2,3,"Brown, Martin and Mann",0,Public,Elementary,927 maple street,1003
3,4,Burns Inc,6,Public,High,1156 maple street,1004
4,5,Weaver-Vargas,0,Public,High,1795 omar park,1005
...,...,...,...,...,...,...,...
1995,1996,"Maldonado, Smith and Fernandez",10,Public,High,449100 maple street,2996
1996,1997,"Brown, Jackson and Hensley",9,Private,High,197703 omar park,2997
1997,1998,Smith-Good,8,Public,Elementary,1824174 dawson terrace,2998
1998,1999,Rodriguez PLC,9,Public,Elementary,177911 cedar lane,2999
1999,2000,Evans and Sons,6,Public,Elementary,896000 cedar lane,3000

In [220]:
home_listings = pd.read_csv('/Users/jy/Desktop/home_listings_cleaned.csv')
home_listings.columns

Index(['Listing ID', 'Title', 'Description', 'Home Type', 'Bedrooms',
       'Bathrooms', 'Year Built', 'Square Footage', 'Listed Price',
       'Listing Type', 'Amenities', 'Street', 'City', 'State', 'Zip Code',
       'Commute Options', 'Listing Date', 'Nearby Schools', 'Utilities',
       'Owner/Seller Name'],
      dtype='object')

In [221]:
# Select only necessary columns
home_listings = home_listings[[ 'Listing ID', 'Bedrooms', 'Bathrooms','Square Footage', 'Home Type', 'Description','Street']]
home_listings.columns = ['listing_id', 'bedrooms', 'bathrooms','sqft', 'type', 'description', 'street']

In [222]:
home_listings['property_id'] = range(1, len(home_listings)+1)

In [223]:
home_listings['street'] = home_listings['street'].str.strip().str.lower()

In [224]:
property = home_listings.merge(addresses_unique[['address_id', 'street']], on='street', how='left')

In [225]:
property

,listing_id,bedrooms,bathrooms,sqft,type,description,street,property_id,address_id
0,8585561689,4,2,2446,Townhouse,This charming 4-bedroom townhouse offers a spa...,56162 omar park,1,3033
1,1550678141,3,2,1853,Townhouse,This luxurious 3-bedroom townhouse offers a sp...,466 dawson terrace apt. 858,2,3034
2,8476052241,1,3,3077,Apartment,This charming 1-bedroom apartment offers a spa...,9026 chad valley,3,3035
3,2107612233,3,2,2079,Townhouse,This charming 3-bedroom townhouse offers a spa...,827 santos stream,4,3036
4,4929040086,3,1,1712,Condo,This luxurious 3-bedroom condo offers a spacio...,3635 alison bridge,5,3037
...,...,...,...,...,...,...,...,...,...
995,7919467850,5,1,908,Townhouse,This luxurious 5-bedroom townhouse offers a sp...,28291 brandon stravenue,996,4028
996,9775018591,3,2,1019,Townhouse,This charming 3-bedroom townhouse offers a spa...,13328 waters ford suite 061,997,4029
997,6429659679,1,2,2821,Single Family Home,This luxurious 1-bedroom single family home of...,033 wilson isle suite 690,998,4030
998,1858711056,3,2,1167,Townhouse,This charming 3-bedroom townhouse offers a spa...,7457 paula pines,999,4031
999,1828375380,4,1,553,Apartment,This charming 4-bedroom apartment offers a spa...,92007 michael corner apt. 146,1000,4032

In [226]:
home_listings = pd.read_csv('/Users/jy/Desktop/home_listings_cleaned.csv')
home_listings.columns

Index(['Listing ID', 'Title', 'Description', 'Home Type', 'Bedrooms',
       'Bathrooms', 'Year Built', 'Square Footage', 'Listed Price',
       'Listing Type', 'Amenities', 'Street', 'City', 'State', 'Zip Code',
       'Commute Options', 'Listing Date', 'Nearby Schools', 'Utilities',
       'Owner/Seller Name'],
      dtype='object')

In [227]:
# Select only necessary columns
listings = home_listings[[ 'Listing ID', 'Listing Date', 'Listed Price','Listing Type' ]]
listings.columns = ['listing_id', 'listing_date', 'list_price','sale_type']

In [228]:
listings = listings.merge(property[['property_id', 'listing_id']], on='listing_id', how='left')

In [229]:
listings

     listing_id listing_date  list_price sale_type  property_id
0    8585561689   2021-05-05        4125      Rent            1
1    1550678141   2022-01-24      923862      Sale            2
2    8476052241   2021-07-17        4310      Rent            3
3    2107612233   2023-09-10        2664      Rent            4
4    4929040086   2024-02-15      781721      Sale            5
..          ...          ...         ...       ...          ...
995  7919467850   2022-05-26     1231441      Sale          996
996  9775018591   2021-12-20        3652      Rent          997
997  6429659679   2022-10-08      488191      Sale          998
998  1858711056   2023-01-11        4081      Rent          999
999  1828375380   2023-04-13        2836      Rent         1000

[1000 rows x 5 columns]

In [230]:
# Select only necessary columns
transaction = transaction[[ 'listing_id', 'Employee Name', 'Client Name','time', 'price','revenues']]
transaction.columns = ['listing_id', 'employee_name', 'client_name','time', 'price', 'revenues']

In [231]:
transaction = transaction.merge(clients[['clients_id', 'client_name']], on='client_name', how='left')
transaction = transaction.merge(employees[['employees_id', 'employee_name']], on='employee_name', how='left')

In [232]:
transaction['transaction_id'] = range(1, len(transaction)+1)

In [233]:
transaction

,listing_id,employee_name,client_name,time,price,revenues,clients_id,employees_id,transaction_id
0,8585561689,"Leon, Patrick","Torres, Robert",6/9/21,4502.79,4502.79000,15,106,1
1,1550678141,"Olson, Andrea","Cox, Megan",2/22/22,972329.33,42361.67258,787,86,2
2,2107612233,"Wilcox, Frank","Flores, Ryan",9/26/23,2964.62,2964.62000,256,62,3
3,4929040086,"Garcia, Christopher","Rojas, Kim",3/28/24,853213.22,29019.66283,145,103,4
4,5607735460,"Turner, Cynthia","Williams, Kimberly",9/5/23,955508.22,39928.50722,274,55,5
...,...,...,...,...,...,...,...,...,...
496,3858492578,"Bell, Christopher","Carroll, Sheila",2/19/22,4869.51,4869.51000,522,108,497
497,7397953436,"Adams, Ashley","Perez, Bonnie",5/31/21,2016269.60,67969.54296,943,6,498
498,7919467850,"Mcgrath, Alison","Horton, Martin",7/6/22,1249915.20,55445.40519,996,111,499
499,1858711056,"Mcguire, Jeanette","Mosley, Mary",2/15/23,4155.69,4155.69000,162,88,500
500,1828375380,"Shaffer, Jacqueline","Jones, Andrew",5/9/23,3096.90,3096.90000,860,60,501

In [234]:
# Select only necessary columns
client_feedback = client_feedback[[ 'Employee Name', 'Client Name', 'time','rating','comment']]
client_feedback.columns = ['employee_name', 'client_name', 'time','rating', 'comment']

In [235]:
client_feedback = client_feedback.merge(clients[['clients_id', 'client_name']], on='client_name', how='left')

In [236]:
client_feedback = client_feedback.merge(employees[['employees_id', 'employee_name']], on='employee_name', how='left')

In [237]:
client_feedback

,employee_name,client_name,time,rating,comment,clients_id,employees_id
0,"Leon, Patrick","Torres, Robert",6/10/21,1,Needs to improve on punctuality for meetings.,15,106
1,"Olson, Andrea","Cox, Megan",2/23/22,2,Disappointed with the lack of follow-up.,787,86
2,"Wilcox, Frank","Flores, Ryan",9/27/23,8,Fantastic! Made the process easy and enjoyable.,256,62
3,"Garcia, Christopher","Rojas, Kim",3/29/24,3,Disappointed with the lack of follow-up.,145,103
4,"Turner, Cynthia","Williams, Kimberly",9/6/23,10,"Great experience, very helpful!",274,55
...,...,...,...,...,...,...,...
496,"Bell, Christopher","Carroll, Sheila",2/20/22,7,Very professional and knowledgeable.,522,108
497,"Adams, Ashley","Perez, Bonnie",6/1/21,6,Could use more detail in the explanations prov...,943,6
498,"Mcgrath, Alison","Horton, Martin",7/7/22,6,Could be more responsive to queries.,996,111
499,"Mcguire, Jeanette","Mosley, Mary",2/16/23,5,Could use more detail in the explanations prov...,162,88
500,"Shaffer, Jacqueline","Jones, Andrew",5/10/23,6,"Very polite and professional, but the process ...",860,60

In [238]:
# Select only necessary columns
appointments = appointments[[ 'Employee Name', 'Client Name', 'time','listing_id']]
appointments.columns = ['employee_name', 'client_name', 'time','listing_id']

In [239]:
appointments = appointments.merge(clients[['clients_id', 'client_name']], on='client_name', how='left')

In [240]:
appointments = appointments.merge(employees[['employees_id', 'employee_name']], on='employee_name', how='left')

In [241]:
appointments

,employee_name,client_name,time,listing_id,clients_id,employees_id
0,"Leon, Patrick","Torres, Robert",6/8/21,8585561689,15,106
1,"Olson, Andrea","Cox, Megan",2/21/22,1550678141,787,86
2,"Wilcox, Frank","Flores, Ryan",9/25/23,2107612233,256,62
3,"Garcia, Christopher","Rojas, Kim",3/27/24,4929040086,145,103
4,"Turner, Cynthia","Williams, Kimberly",9/4/23,5607735460,274,55
...,...,...,...,...,...,...
496,"Bell, Christopher","Carroll, Sheila",2/18/22,3858492578,522,108
497,"Adams, Ashley","Perez, Bonnie",5/30/21,7397953436,943,6
498,"Mcgrath, Alison","Horton, Martin",7/5/22,7919467850,996,111
499,"Mcguire, Jeanette","Mosley, Mary",2/14/23,1858711056,162,88
500,"Shaffer, Jacqueline","Jones, Andrew",5/8/23,1828375380,860,60

In [242]:
office_expenses_data = pd.read_csv('/Users/jy/Desktop/office_expenses.csv')
office_expenses = office_expenses_data
office_expenses.columns

Index(['Office Name', 'Address', 'State', 'City', 'Date', 'Expense Type',
       'Amount'],
      dtype='object')

In [243]:
# Select only necessary columns
office_expenses = office_expenses[[ 'Office Name', 'Amount', 'Expense Type','Date']]
office_expenses.columns = ['office_name', 'expense_amount', 'expense_type','expense_date']

In [244]:
# Assign a unique address_id
office_expenses['expense_id'] = range(1, len(office_expenses) + 1)

/var/folders/5z/lj0frffj3bx0mq3z4v0_zkc00000gn/T/ipykernel_40342/2906156378.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  office_expenses['expense_id'] = range(1, len(office_expenses) + 1)

In [245]:
office_expenses = office_expenses.merge(office[['office_id', 'office_name']], on='office_name', how='left')

In [246]:
office_expenses

,office_name,expense_amount,expense_type,expense_date,expense_id,office_id
0,Dream Homes Bridgeport,11641,rent,2023-02-26,1,2
1,Dream Homes Bridgeport,167,water,2023-02-26,2,2
2,Dream Homes Bridgeport,261,electric,2023-02-26,3,2
3,Dream Homes Bridgeport,159,internet,2023-02-26,4,2
4,Dream Homes Bridgeport,11641,rent,2023-03-28,5,2
...,...,...,...,...,...,...
2799,Dream Homes Buffalo,119,internet,2024-02-22,2800,3
2800,Dream Homes Buffalo,21922,rent,2024-03-23,2801,3
2801,Dream Homes Buffalo,205,water,2024-03-23,2802,3
2802,Dream Homes Buffalo,356,electric,2024-03-23,2803,3
2803,Dream Homes Buffalo,129,internet,2024-03-23,2804,3

In [247]:
home_listings = pd.read_csv('/Users/jy/Desktop/home_listings_cleaned.csv')
home_listings.columns

Index(['Listing ID', 'Title', 'Description', 'Home Type', 'Bedrooms',
       'Bathrooms', 'Year Built', 'Square Footage', 'Listed Price',
       'Listing Type', 'Amenities', 'Street', 'City', 'State', 'Zip Code',
       'Commute Options', 'Listing Date', 'Nearby Schools', 'Utilities',
       'Owner/Seller Name'],
      dtype='object')

In [248]:
# Select only necessary columns
property_amenities = home_listings[[ 'Listing ID', 'Amenities']]
property_amenities.columns = ['listing_id', 'amenities']

In [249]:
property_amenities = property_amenities.merge(listings[['property_id', 'listing_id']], on='listing_id', how='left')

In [250]:
property_amenities.drop('listing_id', axis=1, inplace=True)

In [251]:
import ast

In [252]:
property_amenities['amenities'] = property_amenities['amenities'].apply(ast.literal_eval)
# Now explode the 'amenities' column so each amenity has its own row
exploded_amenities = property_amenities.explode('amenities')

In [253]:
exploded_amenities

     amenities  property_id
0      parking            1
0        patio            1
0    fireplace            1
0      doorman            1
0          gym            1
..         ...          ...
998  fireplace          999
999      patio         1000
999  fireplace         1000
999       pool         1000
999    doorman         1000

[3544 rows x 2 columns]

In [254]:
employees = pd.read_csv('/Users/jy/Desktop/employees.csv')
employees.columns

Index(['Full Name', 'Email', 'Date of Hire', 'Base Salary', 'Office Name',
       'Manager Name'],
      dtype='object')

In [255]:
# Select only necessary columns
managing = employees[[ 'Full Name', 'Manager Name']]
managing.columns = ['employee_name', 'manager_name']

In [256]:
# Select only necessary columns
employees = employees[[ 'Full Name', 'Office Name']]
employees.columns = ['employee_name', 'office_name',]

In [257]:
employees['employees_id'] = range(1, len(employees)+1)

In [258]:
employees.columns = ['name', 'office_name','employees_id']
employees = employees.merge(office[['office_id', 'office_name']], on='office_name', how='left')
employees = employees.merge(all_personal_info[['personal_info_id', 'name']], on='name', how='left')

In [259]:
employees.columns = ['employee_name', 'office_name','employees_id','office_id', 'personal_info_id']

In [260]:
employees

,employee_name,office_name,employees_id,office_id,personal_info_id
0,"Klein, Brian",Dream Homes Albany,1,1,1001
1,"Brown, Ryan",Dream Homes Hartford,2,4,1002
2,"Coffey, Patrick",Dream Homes Bridgeport,3,2,1003
3,"Watson, Samantha",Dream Homes Albany,4,1,1004
4,"Howard, Katherine",Dream Homes New York,5,7,1005
...,...,...,...,...,...
115,"White, Gregory",Dream Homes Stamford,116,11,1116
116,"Evans, Christina",Dream Homes Hartford,117,4,1117
117,"Fry, Joseph",Dream Homes Syracuse,118,12,1118
118,"Cruz, Pamela",Dream Homes Syracuse,119,12,1119
119,"Hopkins, Andrew",Dream Homes Syracuse,120,12,1120

In [261]:
managing

         employee_name     manager_name
0         Klein, Brian     Klein, Brian
1          Brown, Ryan     Klein, Brian
2      Coffey, Patrick      Brown, Ryan
3     Watson, Samantha     Klein, Brian
4    Howard, Katherine      Brown, Ryan
..                 ...              ...
115     White, Gregory   Skinner, Aaron
116   Evans, Christina  Lowery, Michael
117        Fry, Joseph    Hines, Monica
118       Cruz, Pamela   Bright, Robert
119    Hopkins, Andrew      Ross, Molly

[120 rows x 2 columns]

In [262]:
managing = managing.merge(employees[['employees_id', 'employee_name']], on='employee_name', how='left')

In [263]:
employee_to_id = managing[['employee_name', 'employees_id']].drop_duplicates().set_index('employee_name')

In [264]:
managing['manager_id'] = managing['manager_name'].map(employee_to_id['employees_id'])

In [265]:
managing

         employee_name     manager_name  employees_id  manager_id
0         Klein, Brian     Klein, Brian             1           1
1          Brown, Ryan     Klein, Brian             2           1
2      Coffey, Patrick      Brown, Ryan             3           2
3     Watson, Samantha     Klein, Brian             4           1
4    Howard, Katherine      Brown, Ryan             5           2
..                 ...              ...           ...         ...
115     White, Gregory   Skinner, Aaron           116          57
116   Evans, Christina  Lowery, Michael           117          92
117        Fry, Joseph    Hines, Monica           118          99
118       Cruz, Pamela   Bright, Robert           119          61
119    Hopkins, Andrew      Ross, Molly           120          58

[120 rows x 4 columns]

In [266]:
neighborhood_table.to_sql('neighborhood', con=engine, if_exists='append', index=False)

23

In [267]:
with engine.connect() as connection:
    result = connection.execute(text("SELECT * FROM neighborhood"))
    neighborhood = result.fetchall()

for row in neighborhood:
    print(row)

(3, 'Downtown Manhattan', Decimal('1.7'))
(17, 'South Bronx', Decimal('3.6'))
(13, 'Midtown West', Decimal('6.1'))
(20, 'South Trenton', Decimal('1.0'))
(8, 'East Hartford', Decimal('2.7'))
(16, 'Northern Queens', Decimal('9.3'))
(5, 'Downtown Stamford', Decimal('9.4'))
(14, 'North New Haven', Decimal('7.1'))
(4, 'Downtown New London', Decimal('3.2'))
(19, 'South Staten Island', Decimal('6.3'))
(1, 'Downtown Brooklyn', Decimal('4.8'))
(18, 'South Norwalk', Decimal('7.0'))
(7, 'East Elizabeth', Decimal('4.5'))
(9, 'Lower East Side', Decimal('6.8'))
(11, 'Mid New Brunswick', Decimal('7.6'))
(12, 'Midtown East', Decimal('2.1'))
(2, 'Downtown Camden', Decimal('1.3'))
(15, 'North Staten Island', Decimal('2.0'))
(22, 'Upper West Side', Decimal('7.7'))
(23, 'West Bronx', Decimal('1.7'))
(6, 'East Bronx', Decimal('5.7'))
(21, 'Upper East Side', Decimal('8.0'))
(10, 'Lower West Side', Decimal('1.5'))

In [268]:
address_final

,state,street,zip_code,city,address_id,neighborhood_id
0,NY,549 nguyen underpass suite 698,13309,NaN,1,NaN
1,CT,44362 dennis hill,6205,NaN,2,NaN
2,NY,9515 joseph manor apt. 900,10370,NaN,3,NaN
3,NJ,273 bernard ports apt. 062,8790,NaN,4,NaN
4,NY,45976 stone squares apt. 678,14496,NaN,5,NaN
...,...,...,...,...,...,...
4027,NY,28291 brandon stravenue,13271,Syracuse,4028,6.0
4028,NY,13328 waters ford suite 061,12965,New York,4029,16.0
4029,NY,033 wilson isle suite 690,11266,Buffalo,4030,16.0
4030,CT,7457 paula pines,6077,New Haven,4031,14.0
4031,CT,92007 michael corner apt. 146,6056,New Haven,4032,8.0

In [269]:
address_final.to_sql('address', con=engine, if_exists='append', index=False)

32

In [270]:
with engine.connect() as connection:
    result = connection.execute(text("SELECT * FROM address"))
    address = result.fetchall()

for row in address[:5]:
    print(row)

(1, 'NY', None, '549 nguyen underpass suite 698', '13309', None)
(2, 'CT', None, '44362 dennis hill', '6205', None)
(3, 'NY', None, '9515 joseph manor apt. 900', '10370', None)
(4, 'NJ', None, '273 bernard ports apt. 062', '8790', None)
(5, 'NY', None, '45976 stone squares apt. 678', '14496', None)

In [271]:
# Now, we drop the 'street' column as it's no longer needed
office = office.drop(columns='street')

In [272]:
office.to_sql('office', con=engine, if_exists='append', index=False)

14

In [273]:
with engine.connect() as connection:
    result = connection.execute(text("SELECT * FROM office"))
    office = result.fetchall()

for row in office[:5]:
    print(row)

(2, 'Dream Homes Bridgeport', 3001)
(1, 'Dream Homes Albany', 3002)
(5, 'Dream Homes Jersey City', 3006)
(12, 'Dream Homes Syracuse', 3007)
(4, 'Dream Homes Hartford', 3009)

In [274]:
all_personal_info

,name,email,phone_number,personal_info_id
0,"Melton, Ashley",ashley.melton@example.com,6076274707,1
1,"Cooley, Melissa",melissa.cooley@example.com,292-810-9738,2
2,"Gibbs, Angela",angela.gibbs@example.com,001-766-553-7400,3
3,"Gardner, Jasmine",jasmine.gardner@example.com,535.355.1974x252,4
4,"Castro, Charles",charles.castro@example.com,511.384.1001x42377,5
...,...,...,...,...
1115,"White, Gregory",gregory.white@dreamhomes.nyc,NaN,1116
1116,"Evans, Christina",christina.evans@dreamhomes.nyc,NaN,1117
1117,"Fry, Joseph",joseph.fry@dreamhomes.nyc,NaN,1118
1118,"Cruz, Pamela",pamela.cruz@dreamhomes.nyc,NaN,1119
1119,"Hopkins, Andrew",andrew.hopkins@dreamhomes.nyc,NaN,1120

In [275]:
all_personal_info.to_sql('personal_info', con=engine, if_exists='append', index=False)

120

In [276]:
with engine.connect() as connection:
    result = connection.execute(text("SELECT * FROM personal_info"))
    personal_info = result.fetchall()

for row in personal_info[:5]:
    print(row)

(1, 'Melton, Ashley', '6076274707', 'ashley.melton@example.com')
(2, 'Cooley, Melissa', '292-810-9738', 'melissa.cooley@example.com')
(3, 'Gibbs, Angela', '001-766-553-7400', 'angela.gibbs@example.com')
(4, 'Gardner, Jasmine', '535.355.1974x252', 'jasmine.gardner@example.com')
(5, 'Castro, Charles', '511.384.1001x42377', 'charles.castro@example.com')

In [277]:
# Drop 'name' and 'office_name' columns from the employees DataFrame
employees.drop(['employee_name', 'office_name'], axis=1, inplace=True)

In [278]:
employees

     employees_id  office_id  personal_info_id
0               1          1              1001
1               2          4              1002
2               3          2              1003
3               4          1              1004
4               5          7              1005
..            ...        ...               ...
115           116         11              1116
116           117          4              1117
117           118         12              1118
118           119         12              1119
119           120         12              1120

[120 rows x 3 columns]

In [279]:
employees.to_sql('employee', con=engine, if_exists='append', index=False)

120

In [282]:
with engine.connect() as connection:
    result = connection.execute(text("SELECT * FROM employee"))
    employees = result.fetchall()

for row in employees[:5]:
    print(row)

(1, 1, 1001)
(2, 4, 1002)
(3, 2, 1003)
(4, 1, 1004)
(5, 7, 1005)

In [283]:
clients.drop(['client_name'], axis=1, inplace=True)

In [284]:
clients

    preferred_home_type  clients_id  personal_info_id
0                 condo           1                 1
1          single house           2                 2
2                   NaN           3                 3
3                 condo           4                 4
4                   NaN           5                 5
..                  ...         ...               ...
995                 NaN         996               996
996           townhouse         997               997
997           apartment         998               998
998                 NaN         999               999
999                 NaN        1000              1000

[1000 rows x 3 columns]

In [285]:
clients.to_sql('client', con=engine, if_exists='append', index=False)

1000

In [286]:
with engine.connect() as connection:
    result = connection.execute(text("SELECT * FROM client"))
    clients = result.fetchall()

for row in clients[:5]:
    print(row)

(1, 'condo', 1)
(2, 'single house', 2)
(3, None, 3)
(4, 'condo', 4)
(5, None, 5)

In [287]:
school.drop(['street'], axis=1, inplace=True)

In [288]:
school

,school_id,school_name,school_rating,school_type,school_level,address_id
0,1,"Jackson, Smith and Williams",5,Public,Middle,1001
1,2,Wilson Inc,8,Private,High,1002
2,3,"Brown, Martin and Mann",0,Public,Elementary,1003
3,4,Burns Inc,6,Public,High,1004
4,5,Weaver-Vargas,0,Public,High,1005
...,...,...,...,...,...,...
1995,1996,"Maldonado, Smith and Fernandez",10,Public,High,2996
1996,1997,"Brown, Jackson and Hensley",9,Private,High,2997
1997,1998,Smith-Good,8,Public,Elementary,2998
1998,1999,Rodriguez PLC,9,Public,Elementary,2999
1999,2000,Evans and Sons,6,Public,Elementary,3000

In [289]:
school.to_sql('school', con=engine, if_exists='append', index=False)

1000

In [290]:
with engine.connect() as connection:
    result = connection.execute(text("SELECT * FROM school"))
    school = result.fetchall()

for row in school[:5]:
    print(row)

(1, 'Jackson, Smith and Williams', Decimal('5.0'), 'Public', 'Middle', 1001)
(2, 'Wilson Inc', Decimal('8.0'), 'Private', 'High', 1002)
(3, 'Brown, Martin and Mann', Decimal('0.0'), 'Public', 'Elementary', 1003)
(4, 'Burns Inc', Decimal('6.0'), 'Public', 'High', 1004)
(5, 'Weaver-Vargas', Decimal('0.0'), 'Public', 'High', 1005)

In [291]:
property.drop(['street'], axis=1, inplace=True)

In [292]:
property.drop(['listing_id'], axis=1, inplace=True)

In [293]:
property

,bedrooms,bathrooms,sqft,type,description,property_id,address_id
0,4,2,2446,Townhouse,This charming 4-bedroom townhouse offers a spa...,1,3033
1,3,2,1853,Townhouse,This luxurious 3-bedroom townhouse offers a sp...,2,3034
2,1,3,3077,Apartment,This charming 1-bedroom apartment offers a spa...,3,3035
3,3,2,2079,Townhouse,This charming 3-bedroom townhouse offers a spa...,4,3036
4,3,1,1712,Condo,This luxurious 3-bedroom condo offers a spacio...,5,3037
...,...,...,...,...,...,...,...
995,5,1,908,Townhouse,This luxurious 5-bedroom townhouse offers a sp...,996,4028
996,3,2,1019,Townhouse,This charming 3-bedroom townhouse offers a spa...,997,4029
997,1,2,2821,Single Family Home,This luxurious 1-bedroom single family home of...,998,4030
998,3,2,1167,Townhouse,This charming 3-bedroom townhouse offers a spa...,999,4031
999,4,1,553,Apartment,This charming 4-bedroom apartment offers a spa...,1000,4032

In [294]:
property.to_sql('property', con=engine, if_exists='append', index=False)

1000

In [295]:
with engine.connect() as connection:
    result = connection.execute(text("SELECT * FROM property"))
    property = result.fetchall()

for row in property[:5]:
    print(row)

(1, 3033, 4, 2, 2446, 'Townhouse', 'This charming 4-bedroom townhouse offers a spacious living environment, featuring a modern kitchen with state-of-the-art appliances, a cozy gym, and  ... (10 characters truncated) ... ral light throughout the property. Conveniently located in a desirable neighborhood, this home is perfect for those looking for a rental opportunity.')
(2, 3034, 3, 2, 1853, 'Townhouse', 'This luxurious 3-bedroom townhouse offers a spacious living environment, featuring a modern kitchen with state-of-the-art appliances, a cozy gym, and ... (8 characters truncated) ... atural light throughout the property. Conveniently located in a desirable neighborhood, this home is perfect for those looking for style and comfort.')
(3, 3035, 1, 3, 3077, 'Apartment', 'This charming 1-bedroom apartment offers a spacious living environment, featuring a modern kitchen with state-of-the-art appliances, a cozy pool, and ... (11 characters truncated) ... ral light throughout the property. Conveniently located in a desirable neighborhood, this home is perfect for those looking for a rental opportunity.')
(4, 3036, 3, 2, 2079, 'Townhouse', 'This charming 3-bedroom townhouse offers a spacious living environment, featuring a modern kitchen with state-of-the-art appliances, a cozy parking,  ... (14 characters truncated) ... ral light throughout the property. Conveniently located in a desirable neighborhood, this home is perfect for those looking for a rental opportunity.')
(5, 3037, 3, 1, 1712, 'Condo', 'This luxurious 3-bedroom condo offers a spacious living environment, featuring a modern kitchen with state-of-the-art appliances, a cozy patio, and a ... (6 characters truncated) ... atural light throughout the property. Conveniently located in a desirable neighborhood, this home is perfect for those looking for style and comfort.')

In [142]:
listings

     listing_id listing_date  list_price sale_type  property_id
0    8585561689   2021-05-05        4125      Rent            1
1    1550678141   2022-01-24      923862      Sale            2
2    8476052241   2021-07-17        4310      Rent            3
3    2107612233   2023-09-10        2664      Rent            4
4    4929040086   2024-02-15      781721      Sale            5
..          ...          ...         ...       ...          ...
995  7919467850   2022-05-26     1231441      Sale          996
996  9775018591   2021-12-20        3652      Rent          997
997  6429659679   2022-10-08      488191      Sale          998
998  1858711056   2023-01-11        4081      Rent          999
999  1828375380   2023-04-13        2836      Rent         1000

[1000 rows x 5 columns]

In [296]:
listings.to_sql('listing', con=engine, if_exists='append', index=False)

1000

In [298]:
with engine.connect() as connection:
    result = connection.execute(text("SELECT * FROM listing"))
    listings = result.fetchall()

for row in listings[:5]:
    print(row)

(8585561689, 1, datetime.date(2021, 5, 5), Decimal('4125.00'), 'Rent')
(1550678141, 2, datetime.date(2022, 1, 24), Decimal('923862.00'), 'Sale')
(8476052241, 3, datetime.date(2021, 7, 17), Decimal('4310.00'), 'Rent')
(2107612233, 4, datetime.date(2023, 9, 10), Decimal('2664.00'), 'Rent')
(4929040086, 5, datetime.date(2024, 2, 15), Decimal('781721.00'), 'Sale')

In [299]:
transaction.drop(['employee_name', 'client_name'], axis=1, inplace=True)

In [300]:
transaction.columns = ['listing_id', 'time', 'price','revenues', 'clients_id','employees_id','transaction_id']

In [301]:
transaction.to_sql('transaction', con=engine, if_exists='append', index=False)

501

In [302]:
with engine.connect() as connection:
    result = connection.execute(text("SELECT * FROM transaction"))
    transaction = result.fetchall()

for row in transaction[:5]:
    print(row)

(1, 8585561689, 106, 15, datetime.date(2021, 6, 9), Decimal('4502.79'), Decimal('4502.79'))
(2, 1550678141, 86, 787, datetime.date(2022, 2, 22), Decimal('972329.33'), Decimal('42361.67'))
(3, 2107612233, 62, 256, datetime.date(2023, 9, 26), Decimal('2964.62'), Decimal('2964.62'))
(4, 4929040086, 103, 145, datetime.date(2024, 3, 28), Decimal('853213.22'), Decimal('29019.66'))
(5, 5607735460, 55, 274, datetime.date(2023, 9, 5), Decimal('955508.22'), Decimal('39928.51'))

In [303]:
client_feedback.drop(['employee_name', 'client_name'], axis=1, inplace=True)

In [304]:
client_feedback

,time,rating,comment,clients_id,employees_id
0,6/10/21,1,Needs to improve on punctuality for meetings.,15,106
1,2/23/22,2,Disappointed with the lack of follow-up.,787,86
2,9/27/23,8,Fantastic! Made the process easy and enjoyable.,256,62
3,3/29/24,3,Disappointed with the lack of follow-up.,145,103
4,9/6/23,10,"Great experience, very helpful!",274,55
...,...,...,...,...,...
496,2/20/22,7,Very professional and knowledgeable.,522,108
497,6/1/21,6,Could use more detail in the explanations prov...,943,6
498,7/7/22,6,Could be more responsive to queries.,996,111
499,2/16/23,5,Could use more detail in the explanations prov...,162,88
500,5/10/23,6,"Very polite and professional, but the process ...",860,60

In [305]:
client_feedback.to_sql('client_feedback', con=engine, if_exists='append', index=False)

501

In [306]:
with engine.connect() as connection:
    result = connection.execute(text("SELECT * FROM client_feedback"))
    client_feedback = result.fetchall()

for row in client_feedback[:5]:
    print(row)

(15, 106, datetime.datetime(2021, 6, 10, 0, 0), 1, 'Needs to improve on punctuality for meetings.')
(787, 86, datetime.datetime(2022, 2, 23, 0, 0), 2, 'Disappointed with the lack of follow-up.')
(256, 62, datetime.datetime(2023, 9, 27, 0, 0), 8, 'Fantastic! Made the process easy and enjoyable.')
(145, 103, datetime.datetime(2024, 3, 29, 0, 0), 3, 'Disappointed with the lack of follow-up.')
(274, 55, datetime.datetime(2023, 9, 6, 0, 0), 10, 'Great experience, very helpful!')

In [307]:
appointments.drop(['employee_name', 'client_name'], axis=1, inplace=True)

In [308]:
appointments.to_sql('appointments', con=engine, if_exists='append', index=False)

501

In [309]:
with engine.connect() as connection:
    result = connection.execute(text("SELECT * FROM appointments"))
    appointments = result.fetchall()

for row in appointments[:5]:
    print(row)

(106, 15, datetime.date(2021, 6, 8), 8585561689)
(86, 787, datetime.date(2022, 2, 21), 1550678141)
(62, 256, datetime.date(2023, 9, 25), 2107612233)
(103, 145, datetime.date(2024, 3, 27), 4929040086)
(55, 274, datetime.date(2023, 9, 4), 5607735460)

In [310]:
office_expenses.drop('office_name', axis=1, inplace=True)

In [311]:
office_expenses.to_sql('expense', con=engine, if_exists='append', index=False)

804

In [313]:
with engine.connect() as connection:
    result = connection.execute(text("SELECT * FROM expense"))
    office_expenses = result.fetchall()

for row in office_expenses[:5]:
    print(row)

(1, 2, Decimal('11641.00'), 'rent', datetime.date(2023, 2, 26))
(2, 2, Decimal('167.00'), 'water', datetime.date(2023, 2, 26))
(3, 2, Decimal('261.00'), 'electric', datetime.date(2023, 2, 26))
(4, 2, Decimal('159.00'), 'internet', datetime.date(2023, 2, 26))
(5, 2, Decimal('11641.00'), 'rent', datetime.date(2023, 3, 28))

In [314]:
exploded_amenities.to_sql('property_amenities', con=engine, if_exists='append', index=False)

544

In [315]:
with engine.connect() as connection:
    result = connection.execute(text("SELECT * FROM property_amenities"))
    amenities = result.fetchall()

for row in amenities[:5]:
    print(row)

(1, 'parking')
(1, 'patio')
(1, 'fireplace')
(1, 'doorman')
(1, 'gym')

In [316]:
managing.drop(['employee_name', 'manager_name'], axis=1, inplace=True)

In [317]:
managing.to_sql('managing', con=engine, if_exists='append', index=False)

120

In [318]:
with engine.connect() as connection:
    result = connection.execute(text("SELECT * FROM managing"))
    managing = result.fetchall()

for row in managing[:5]:
    print(row)

(1, 1)
(2, 1)
(3, 2)
(4, 1)
(5, 2)